# Parameter Type Id Rebar Shape Crank End Ratio Property

Source: https://www.revitapidocs.com/2026/96248d89-1caf-7c37-d8a7-0145250b1dfa.htm

---

| Parameter Type Id Rebar Shape Crank End Ratio Property |
| --- |

"End Crank Slope 1:"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeCrankEndRatio { get; }
```

```
Public Shared ReadOnly Property RebarShapeCrankEndRatio As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeCrankEndRatio {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeCrankEndRatio : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace